<a href="https://colab.research.google.com/github/jfzo/notebooks-cursos/blob/master/usando_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Manejo de datos con Python y Pandas

En esta primera parte del módulo, trabajaremos con el siguiente conjunto de datos:

![Online retail](https://archive.ics.uci.edu/ml/datasets/Online%20Retail)

Citando la descripción original:

**Data Set Information:**

This is a transnational data set which contains all the transactions occurring between 01/12/2010 and 09/12/2011 for a UK-based and registered non-store online retail.The company mainly sells unique all-occasion gifts. Many customers of the company are wholesalers.

**Attribute Information:**

| Campo | Descripción |
|------|-----|
| InvoiceNo: | Invoice number. Nominal, a 6-digit integral number uniquely assigned to each transaction. If this code starts with letter **'c'**, it indicates a cancellation.|
|StockCode: | Product (item) code. Nominal, a 5-digit integral number uniquely assigned to each distinct product.|
|Description: | Product (item) name. Nominal.|
|Quantity: | The quantities of each product (item) per transaction. Numeric.|
|InvoiceDate: | Invice Date and time. Numeric, the day and time when each transaction was generated.|
|UnitPrice: | Unit price. Numeric, Product price per unit in sterling.|
|CustomerID: | Customer number. Nominal, a 5-digit integral number uniquely assigned to each customer.|
|Country: | Country name. Nominal, the name of the country where each customer resides. |

In [0]:
#@title Acceso a librería Pandas
import pandas as pd

Es posible cargar la data en un Dataframe a partir de la URL del repositorio:

In [0]:
df = pd.read_excel('http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx')
df.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [0]:
from google.colab import drive
drive.mount('/content/gdrive')

df.to_excel('/content/gdrive/My Drive/Colab Notebooks/online_retail.xlsx')

   Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
0           0    536365    85123A  ...      2.55     17850.0  United Kingdom
1           1    536365     71053  ...      3.39     17850.0  United Kingdom
2           2    536365    84406B  ...      2.75     17850.0  United Kingdom
3           3    536365    84029G  ...      3.39     17850.0  United Kingdom
4           4    536365    84029E  ...      3.39     17850.0  United Kingdom

[5 rows x 9 columns]

---

También es posible cargar desde Google Drive. Las primeras dos líneas comentadas corresponden a las sentencias usadas para conectarse a su cuenta de Google Drive:

In [4]:
from google.colab import drive
drive.mount('/content/gdrive')

df = pd.read_excel('/content/gdrive/My Drive/Colab Notebooks/online_retail.xlsx')
#df.head()

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/gdrive

Podemos averiguar el tamaño del dataframe con su propiedad ```.shape```

In [5]:
df.shape

(541909, 9)

Podemos averiguar el detalle de cada columna del dataframe con su método interno ```.info()```

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532621 entries, 0 to 541908
Data columns (total 9 columns):
Unnamed: 0     532621 non-null int64
InvoiceNo      532621 non-null object
StockCode      532621 non-null object
Description    531166 non-null object
Quantity       532621 non-null int64
InvoiceDate    532621 non-null datetime64[ns]
UnitPrice      532621 non-null float64
CustomerID     397924 non-null float64
Country        532621 non-null object
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 40.6+ MB

In [0]:
df.describe()

          Unnamed: 0       Quantity      UnitPrice     CustomerID
count  532621.000000  532621.000000  532621.000000  397924.000000
mean   271182.113612      10.239972       3.847621   15294.315171
std    156533.716737     159.593551      41.758023    1713.169877
min         0.000000   -9600.000000  -11062.060000   12346.000000
25%    135604.000000       1.000000       1.250000   13969.000000
50%    271292.000000       3.000000       2.080000   15159.000000
75%    406975.000000      10.000000       4.130000   16795.000000
max    541908.000000   80995.000000   13541.330000   18287.000000

In [0]:
#@title Visualización de los primeros 8 registros del dataframe
df.head(8)

   Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
0           0    536365    85123A  ...      2.55     17850.0  United Kingdom
1           1    536365     71053  ...      3.39     17850.0  United Kingdom
2           2    536365    84406B  ...      2.75     17850.0  United Kingdom
3           3    536365    84029G  ...      3.39     17850.0  United Kingdom
4           4    536365    84029E  ...      3.39     17850.0  United Kingdom
5           5    536365     22752  ...      7.65     17850.0  United Kingdom
6           6    536365     21730  ...      4.25     17850.0  United Kingdom
7           7    536366     22633  ...      1.85     17850.0  United Kingdom

[8 rows x 9 columns]

In [0]:
#@title Ordenamiento de los registros según columna *Descripción* 
df['Description'] = df['Description'].str.strip()
df.sort_values(by='Description', ascending=True).head(8)

        Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
20749        20749    538071     21120  ...     16.98         NaN  United Kingdom
35675        35675    539437     20954  ...      8.47         NaN  United Kingdom
37095        37095    539453     20954  ...      8.47         NaN  United Kingdom
394482      394482    570872     22418  ...      1.63         NaN  United Kingdom
381759      381759    569893     22418  ...      0.85     12627.0         Germany
152701      152701    549682     22418  ...      0.85     12596.0           Spain
20498        20498    538057     22418  ...      0.85     13102.0  United Kingdom
470060      470060    576617     22418  ...      1.63         NaN  United Kingdom

[8 rows x 9 columns]

In [0]:
#@title Considerando únicamente los campos tipo *object*
df.select_dtypes(include=['object']).head() #.copy() en lugar de .head() genera una copia del Dataframe

  InvoiceNo StockCode                          Description         Country
0    536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER  United Kingdom
1    536365     71053                  WHITE METAL LANTERN  United Kingdom
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER  United Kingdom
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE  United Kingdom
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.  United Kingdom

In [0]:
#@title Considerando solo aquellas filas cuya columna *Country* coincida con *France*:
df[df["Country"] == "France"].head()

    Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID Country
26          26    536370     22728  ...      3.75     12583.0  France
27          27    536370     22727  ...      3.75     12583.0  France
28          28    536370     22726  ...      3.75     12583.0  France
29          29    536370     21724  ...      0.85     12583.0  France
30          30    536370     21883  ...      0.65     12583.0  France

[5 rows x 9 columns]

In [0]:
#@title Otra manera de filtrar, pero usando más de un valor de búsqueda:
df[df.Country.isin(['France','Spain'])].sort_values(by='Country', ascending=True).tail(10)

        Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID Country
315729      315729    564734    47590B  ...      5.45     12484.0   Spain
315728      315728    564734     47566  ...      4.95     12484.0   Spain
315727      315727    564734     23298  ...      4.95     12484.0   Spain
315726      315726    564734    47566B  ...      4.95     12484.0   Spain
315725      315725    564734    47590A  ...      5.45     12484.0   Spain
315724      315724    564734     22384  ...      1.65     12484.0   Spain
315723      315723    564734     21625  ...      6.95     12484.0   Spain
315722      315722    564734     22611  ...      4.95     12484.0   Spain
414283      414283    572442     22739  ...      1.65     12546.0   Spain
248794      248794    558871     21243  ...      1.69     12557.0   Spain

[10 rows x 9 columns]

In [0]:
#@title Otra manera de filtrar, pero usando condiciones sobre más de una columna:
#df[df.Country.isin(['France','Spain']) & df["Quantity"] < 3].tail(10)
df[(df["InvoiceDate"] < '2011-09-01') & (df["InvoiceDate"] > '2011-01-01')].head()

       Unnamed: 0 InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
42481       42481    539993     22386  ...      1.95     13313.0  United Kingdom
42482       42482    539993     21499  ...      0.42     13313.0  United Kingdom
42483       42483    539993     21498  ...      0.42     13313.0  United Kingdom
42484       42484    539993     22379  ...      2.10     13313.0  United Kingdom
42485       42485    539993     20718  ...      1.25     13313.0  United Kingdom

[5 rows x 9 columns]

----
## Selección de columnas

In [8]:
df["Country"].head()

0    United Kingdom
1    United Kingdom
2    United Kingdom
3    United Kingdom
4    United Kingdom
Name: Country, dtype: object

---

There is a little cleanup, we need to do. First, some of the descriptions have spaces that need to be removed. We’ll also drop the rows that don’t have invoice numbers and remove the credit transactions (those with invoice numbers containing C).

**Primero** debemos hacer algo de limpieza:

1. Eliminación de espacios extra en las descripciones.
2. Eliminar aquellas fileas que no tienen número de Invoice.
3. Quitar

In [0]:
df['Description'] = df['Description'].str.strip()
df.dropna(axis=0, subset=['InvoiceNo'], inplace=True)
df['InvoiceNo'] = df['InvoiceNo'].astype('str')
df = df[~df['InvoiceNo'].str.contains('C')]